#include "minishell.h"

void	shell_welcome(void)
{
	char	*lines[] = {"━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━",
			"",
			" ░▒▓██████▓▒░░▒▓███████▓▒░ ░▒▓██████▓▒░░▒▓███████▓▒░░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░",
			"░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░",
			"░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░",
			"░▒▓█▓▒░      ░▒▓███████▓▒░░▒▓████████▓▒░▒▓███████▓▒░░▒▓███████▓▒░ ░▒▓██████▓▒░",
			"░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░",
			"░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░  ░▒▓█▓▒░",
			" ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓███████▓▒░░▒▓███████▓▒░   ░▒▓█▓▒░",
			"", "              Proyecto Minishell hecho por dcerezo- y maalonso",
			"━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\n",
			"⚠️  Welcome to Minishell ⚠️\n", NULL};
	int		index;

	ft_putstr("\x1B"
				"c");
	index = 0;
	ft_putstr_fd("\033[38;5;208m", STDOUT_FILENO);
	while (lines[index])
	{
		if (ft_strncmp(lines[index], "━━━━━━━━", 18) == 0
			|| ft_strncmp(lines[index], "⚠️  Welcome to Minishell ⚠️", 32) == 0)
			ft_putstr_fd("\033[38;5;39m", STDOUT_FILENO);
		ft_putendl_fd((char *)lines[index], STDOUT_FILENO);
		if (ft_strncmp(lines[index], "━━━━━━━━", 18) == 0
			|| ft_strncmp(lines[index], "⚠️  Welcome to Minishell ⚠️", 32) == 0)
			ft_putstr_fd("\033[38;5;208m", STDOUT_FILENO);
		index++;
	}
	ft_putstr_fd("\033[0m", STDOUT_FILENO);
}
